/********************************************************************************************************************************************
*                                                                                                                                           *
*                ---------------------------------以下是模块的修改记录区---------------------------------                                   *
*                                                                                                                                           *
********************************************************************************************************************************************/
/***********************************************
 * 内容：按键
 * 日期：2016/9/29
 * 作者：陈勇
 * 版本号：V1.0（初版）
 ***********************************************
 * 修改内容：
 * 修改日期：
 * 修改作者：
 * 版本号：
 ***********************************************/


/********************************************************************************************************************************************
*                                                                                                                                           *
*                ---------------------------------以下是模块的使用说明区---------------------------------                                   *
*                                                                                                                                           *
********************************************************************************************************************************************/
/*                                           模块使用说明：
 *
 * 该模块是按键模块，使用步骤如下：
 * 1.在"APP_U_Key.c"文件里的"APP_Key_Init"函数内配置按键相关IO口，并放在项目主循环之前。（如果在扫描按键过程中需要频繁改变IO口方向的话就跳过该步）
 * 2.在"APP_U_Key.h"文件里自定义按键名和IO口名。
 * 3.在"APP_U_Key.c"文件里的"Key_CurrentTime_ms"、"Key_TimingQuery_30ms"、"Key_TimingQuery_3s"三个函数内编写定时代码。
 * 4.在"APP_U_Key.c"文件里的"Key_Check"函数内编写按键扫描代码。
 * 5.在"APP_U_Key.c"文件里的"Key_Task"函数内编写按键任务代码。
 * 6.将"APP_Key_Scanning"函数放在项目主循环里，如果分配成分时任务就要与"APP_Key_CurrentState"函数配合工作，如果是实时任务就可以单独工作。
 *
 */
#include "BSP.h"


/********************************************************************************************************************************************
*                                                                                                                                           *
*               ---------------------------------以下是模块的对接函数区---------------------------------                                    *
*                                                                                                                                           *
********************************************************************************************************************************************/


/********************************************************************************************************************************************
*                                                                                                                                           *
*               ---------------------------------以下是模块的内部函数申明区---------------------------------                                *
*                                                                                                                                           *
********************************************************************************************************************************************/
extern u16 Key_CurrentTime_ms(void);  //获取当前时间
extern u8 Key_TimingQuery_30ms(u16 StartingTime_ms);  //定时查询30毫秒
extern u8 Key_TimingQuery_3s(u16 StartingTime_ms);  //定时查询3秒

extern u8 Key_Check(u8 *PressDownKey);  //按键检测
extern u8 Key_Task(u8 PressDownKey,u8 KeyMode);  //执行按键任务


/********************************************************************************************************************************************
*                                                                                                                                           *
*               ---------------------------------以下是模块的变量申明和宏定义区---------------------------------                            *
*                                                                                                                                           *
********************************************************************************************************************************************/
vu8 KeyStatus = AwaitOrders;  //按键当前的工作状态


/********************************************************************************************************************************************
*                                                                                                                                           *
*                ---------------------------------以下是模块的系统函数代码区---------------------------------                               *
*                                                                                                                                           *
********************************************************************************************************************************************/
/***************************************************************************
* 函数名：  APP_Key_Scanning
* 功能描述：按键扫描
* 入口参数：无
* 出口参数：无
* 注意事项：该函数必须放在项目主循环内，当按键模块被分配成分时任务的情况下需
*           要配合"APP_Key_CurrentState"函数一起工作，如果不是按键模块工作的
*           时段检测出按键模块处于忙碌状态的话，那么就要让按键模块一直工作到
*           空闲状态为止，出现这种情况是因为按键模块在自己的工作时段还未完成
*           任务就超出了时段，所以就算是跨时段工作也要让它把剩余的工作完成，
*           如果分配成实时任务的话就可以单独工作。
* 修改记录：无
*           2016/9/29 BY:陈勇
***************************************************************************/
void APP_Key_Scanning(void)
{
    static u8 PressDownKey;  //当前被按下的按键
    static vu16 StartingTime_ms;  //用于定时的起始时间（毫秒）
    
    switch(KeyStatus)  //按键当前的工作状态
    {
        case AwaitOrders:  //待机
             {
                 if(Key_Check(&PressDownKey) == PressDown)  //如果有按键被按下
                 {
                     KeyStatus = PressDownDispelDithering;  //就进入按下去抖状态
                     StartingTime_ms = Key_CurrentTime_ms();  //获取当前时间，用于按下去抖定时30毫秒
                 }
             }
             break;
             
        case PressDownDispelDithering:  //按下去抖
             {
                 if(Key_TimingQuery_30ms(StartingTime_ms) == TimeOut)  //去抖定时到没？定时30毫秒
                 {
                     if(Key_Check(&PressDownKey) == PressDown)  //如果去抖后按键还是按下
                     {
                         vu8 a;
                         
                         a = Key_Task(PressDownKey,SharedTask);  //执行共同任务（如：按键声），如果只有点动功能的话就可以直接在这里执行完成，跳过下面的点动和常按函数。
                         if(a == HangInTheAir)  //按键任务未执行完成
                         {
                             KeyStatus = CheckPressDownMode;  //进入检测按下方式状态
                             StartingTime_ms = Key_CurrentTime_ms();  //获取当前时间，用于定时检测按键按下方式3秒
                         }
                         else if(a == HasBeenCompleted)  //按键任务已执行完成
                         {
                             KeyStatus = WaitUnclinch;  //执行完后进入等待弹开状态
                         }
                     }
                     else  //如果去抖后按键已弹开
                     {
                         KeyStatus = AwaitOrders;  //说明是误判，回到待机状态
                     }
                 }
             }
             break;
             
        case CheckPressDownMode:  //检测按下方式
             {
                 if(Key_TimingQuery_3s(StartingTime_ms) == TimeOut)  //如果定时3秒已到
                 {
                     Key_Task(PressDownKey,PressDownStabilize);  //说明是常按，执行常按功能
                     KeyStatus = WaitUnclinch;  //执行完后进入等待弹开状态
                 }
                 else  //如果定时没到
                 {
                     if(Key_Check(&PressDownKey) == NoPressDown)  //这时按键已经弹开
                     {
                         Key_Task(PressDownKey,PressDownOnce);  //说明是点动，执行点动功能
                         KeyStatus = UnclinchDispelDithering;  //执行完后进入弹开去抖状态
                         StartingTime_ms = Key_CurrentTime_ms();  //获取当前时间，用于弹开去抖定时30毫秒
                     }
                 }
             }
             break;
             
        case WaitUnclinch:  //等待弹开
             {
                 if(Key_Check(&PressDownKey) == NoPressDown)  //如果按键已弹开
                 {
                     KeyStatus = UnclinchDispelDithering;  //就进入弹开去抖状态
                     StartingTime_ms = Key_CurrentTime_ms();  //获取当前时间，用于弹开去抖定时30毫秒
                 }
             }
             break;
             
        case UnclinchDispelDithering:  //弹开去抖
             {
                 if(Key_TimingQuery_30ms(StartingTime_ms) == TimeOut)  //去抖定时到没？定时30毫秒
                 {
                     if(Key_Check(&PressDownKey) == NoPressDown)  //如果去抖后按键还是弹开
                     {
                         KeyStatus = AwaitOrders;  //就进入待机状态
                     }
                     else
                     {
                         KeyStatus = WaitUnclinch;  //否则回到等待弹开状态
                     }
                 }
             }
             break;
             
        default: break;
    }
}


/***************************************************************************
* 函数名：  APP_Key_CurrentState
* 功能描述：按键模块的当前状态
* 入口参数：无
* 出口参数：Free：当前按键模块处于空闲状态
*           Busy：当前按键模块处于忙碌状态
* 注意事项：当按键模块被分配成分时任务的情况下才需要该函数配合"APP_Key_Scanning"
*           函数一起工作，如果不是按键模块工作的时段检测出按键模块处于忙碌状
*           态的话，那么就要让按键模块一直工作到空闲状态为止，出现这种情况是
*           因为按键模块在自己的工作时段还未完成任务就超出了时段，所以就算是
*           跨时段工作也要让它把剩余的工作完成，如果分配成实时任务的话就可以
*           让"APP_Key_Scanning"函数单独工作，不需要该函数。
* 修改记录：无
*           2016/9/29 BY:陈勇
***************************************************************************/
u8 APP_Key_CurrentState(void)
{
    if(KeyStatus == AwaitOrders)  //如果当前按键处于待机状态
    {
        return Free;  //返回空闲
    }
    else  //如果处于其它状态
    {
        return Busy;  //返回忙碌
    }
}


/********************************************************************************************************************************************
*                                                                                                                                           *
*               ---------------------------------以下是模块的内部函数代码区---------------------------------                                *
*                                                                                                                                           *
********************************************************************************************************************************************/


/********************************************************************************************************************************************
*                                                                                                                                           *
*               ---------------------------------以下是模块的用户函数代码区---------------------------------                                *
*                                                                                                                                           *
********************************************************************************************************************************************/


